Catalogs/ОчередиЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ОчередиЗаданий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Comment>Выполнемый метод общего модуля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Comment>Число секунд между повторами. Если незадано - непериодическое задание</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Старт</Name>
					<Comment>Если указаны дни недели, тогда дата игнорируется</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОчередиЗаданий/Ext/ManagerModule.bsl
Функция ДобавитьЗадание(Наименование, Метод, Параметры, Старт) Экспорт
	Оч 		 		= Справочники.ОчередиЗаданий.СоздатьЭлемент();
	Оч.Наименование	= Наименование;
	Оч.Метод 		= Метод;
	Оч.Параметры 	= Параметры;
	Оч.Старт 		= Старт;
	Попытка
		Оч.Записать();	
	Исключение
		ЗаписьЖурналаРегистрации("Справочники.ОчередиЗаданий.ДобавитьЗадани", УровеньЖурналаРегистрации.Ошибка,,СтрШаблон("Наименование=%1, Метод=%2, Параметры=%3, Старт=%4", Наименование, Метод, Параметры, Старт) ,ОписаниеОшибки());
		Возврат "ошибка";
	КонецПопытки;		
	Возврат "";
КонецФункции
